{
  "createdDate": "12/12/2021",
  "image": "balsamic-roasted-mushrooms-with-herby-kale-mashed-potatoes.jpg",
  "ingredients": [
    {
      "category": "Balsamic Roasted Mushrooms",
      "items": [
        "1 lb. mushrooms",
        "1 Tbsp olive oil",
        "3 Tbsp balsamic vinegar",
        "1/2 Tbsp brown sugar",
        "1 Tbsp soy sauce",
        "2 cloves garlic, minced",
        "1/4 tsp dried thyme"
      ]
    },
    {
      "category": "Herby Kale Mashed Potatoes",
      "items": [
        "2 lbs. russet potatoes",
        "6 oz. kale, chopped",
        "1 Tbsp olive oil",
        "3/4 tsp salt, divided",
        "1/2 cup sour cream",
        "1/2 cup milk",
        "1 tsp dried parsley",
        "1/2 tsp dried oregano",
        "1/2 tsp dried basil",
        "1/4 tsp garlic powder",
        "1/4 tsp onion powder",
        " freshly cracked pepper"
      ]
    }
  ],
  "instructions": [
    "Preheat the oven to 400ºF. Wash the mushrooms and cut them in half if they are large.",
    "In a small dish, stir together the olive oil, balsamic vinegar, brown sugar, soy sauce, minced garlic, and thyme. Place the mushrooms in a casserole dish big enough to allow them to be in a single layer. Pour the balsamic marinade over top and stir until the mushrooms are coated.",
    "Transfer the the mushrooms to the preheated oven and roast for 45 minutes, giving them a stir every 15 minutes. After 45 minutes the mushrooms should be tender and there should be a nice sauce in the bottom of the dish.",
    "Meanwhile, prepare the mashed potatoes. Peel and dice the potatoes into one-inch cubes. Rinse the cubes well in a colander, then place them in a large pot, add 1/2 tsp salt, and cover with cool water. Place a lid on the pot, bring it up to a boil. Boil the potatoes until they are very tender (about 7-10 minutes).",
    "Once the potatoes are very tender, drain them in the colander and rinse them briefly with hot water. Let the potatoes drain in the colander as you prepare the kale.",
    "To the pot used to boil the potatoes, add the chopped kale, 1 Tbsp olive oil, and 2 Tbsp water. Sauté over medium heat just until wilted (3-5 minutes), then remove the kale from the pot.",
    "Return the drained potatoes to the pot along with the sour cream, milk, dried parsley, oregano, basil, garlic powder, onion powder, 1/4 tsp salt, and some freshly cracked pepper. Mash the potatoes until smooth, then taste and add more salt if needed. Stir in the sautéed kale. ",
    "To make the bowls, add 1/4 of the herby kale mashed potatoes to each bowl, then top with 1/4 of the balsamic roasted mushrooms. Drizzle a spoonful or two of the juices from the bottom of the casserole dish over the mushrooms and mashed potatoes. "
  ],
  "notes": ["Add an extra half pound of mushrooms to this"],
  "rating": 6,
  "servings": 4,
  "slug": "balsamic-roasted-mushrooms-with-herby-kale-mashed-potatoes",
  "source": "https://www.budgetbytes.com/balsamic-roasted-mushrooms-with-herby-kale-mashed-potatoes/",
  "tags": ["Vegetarian", "Meal Prep", "Dinner", "Roasting", "Stovetop"],
  "time": [
    {
      "label": "Prep",
      "units": [
        {
          "measurement": 25,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 45,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 10,
          "label": "minutes"
        }
      ]
    }
  ],
  "title": "Balsamic Roasted Mushrooms with Herby Kale Mashed Potatoes"
}
