{
  "archived": false,
  "createdDate": "08/16/2023",
  "image": "creamy-chicken-and-gnocchi.jpg",
  "ingredients": [
    {
      "category": "All",
      "items": [
        "1.25 lbs chicken thighs (4 to 5 thighs)",
        "1 Tbsp Italian Seasoning",
        "1/2 tsp smoked paprika",
        "1/2 tsp salt",
        "1/4 tsp pepper",
        "2 Tbsp cooking oil",
        "1 medium yellow onion, diced",
        "2 garlic cloves",
        "2 Tbsp salted butter, divided",
        "1 lb potato gnocchi (dry)",
        "2 cups fresh spinach",
        "1 cup vegetable broth",
        "1/2 cup heavy cream",
        "1/4 cup Parmesan"
      ]
    }
  ],
  "instructions": [
    "Dice the chicken thighs into 2-inch pieces. Add the chicken to a bowl and top it with Italian seasoning, smoked paprika, salt, and pepper. Mix until combined.",
    "Place a large, deep skillet over medium heat and add the cooking oil. Once it's shimmering, add the chicken and cook undisturbed until well browned, about 3 minutes. Stir and brown on the other side, about 3 more minutes. Remove the chicken from the pan when it's cooked through and leave the fat in the pan.",
    "Add the onion and garlic to the skillet. Saute until the onions have softened and the garlic is fragrant, about 2 minutes",
    "Add the gnocchi and 1 tablespoon salted butter to the skillet and brown for 2 minutes.",
    "Add the spinach and the broth to the skillet. Cover the pan. Cook for 1 to 2 minutes until the spinach has wilted and the gnocchi has hydrated.",
    "Add the heavy cream and the remaining 1 tablespoon of salted butter to the skillet. Stir until the butter has melted and the cream is steaming hot but not boiling.",
    "Take the skillet off the heat. Add the parmesan to the pan and stir until it melts, creating a velvety sauce.",
    "Finally, return the cooked diced chicken to the skillet. Mix gently into the gnocchi and cream sauce. If desired, garnish with parsley."
  ],
  "notes": ["1\" - 1 1/2\" chicken pieces"],
  "rating": 7,
  "related": [],
  "servings": 4,
  "slug": "creamy-chicken-and-gnocchi",
  "source": {
    "name": "Budgetbytes",
    "url": "https://www.budgetbytes.com/creamy-chicken-and-gnocchi/"
  },
  "tags": ["Poultry", "Pasta", "Stovetop"],
  "time": [
    {
      "label": "Prep",
      "units": [
        {
          "measurement": 10,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 25,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 35,
          "label": "minutes"
        }
      ]
    }
  ],
  "title": "Creamy Chicken and Gnocchi"
}
