{
  "createdDate": "10/17/2021",
  "image": "curried-ground-beef-with-peas-and-potatoes.webp",
  "ingredients": [
    {
      "category": "All",
      "items": [
        "4 cloves garlic, minced",
        "1 tsp grated fresh ginger",
        "2 Tbsp cooking oil",
        "1 Tbsp curry powder",
        "1 tsp turmeric",
        "1/4 tsp crushed red pepper (optional)",
        "1 lb. ground beef (15% fat or less)",
        "1 russet potato (¾ lb.) ",
        "1 cup beef broth",
        "1 cup frozen peas",
        "1/2 tsp salt",
        "2 green onions, sliced (optional)"
      ]
    }
  ],
  "instructions": [
    "Add the minced garlic, grated ginger, and cooking oil to a large deep skillet. Sauté the garlic and ginger over medium heat for 1-2 minutes. Add the curry powder, turmeric, and crushed red pepper and sauté for one minute more.",
    "Add the ground beef to the skillet with the spices and sauté until the beef is cooked through.",
    "While the beef is cooking, peel and cube the potato into ½-inch pieces.",
    "Add the cubed potato and beef broth to the skillet. Stir to combine with the ground beef. Place a lid on the skillet and turn the heat up to medium-high. Allow the broth to come up to a boil.",
    "Once the broth reaches a boil, turn the heat down to medium-low and allow it to continue to simmer for 10 minutes with the lid in place (stir occasionally). After ten minutes, the potatoes should be tender. Remove the lid and simmer for a few more minutes, or until most of the broth is evaporated.",
    "Finally, stir the frozen peas into the beef and potato mixture and heat through. Give the curry beef a taste and add salt to taste (about ½ tsp). Top with sliced green onions and serve hot. "
  ],
  "notes": ["Solid, quick, cheap, and easy"],
  "rating": 6,
  "servings": 6,
  "slug": "curried-ground-beef-with-peas-and-potatoes",
  "source": {
    "url": "https://www.budgetbytes.com/curry-beef-with-peas/",
    "name": "Budgetbytes"
  },
  "tags": ["Beef", "Dinner", "Stovetop"],
  "time": [
    {
      "label": "Prep",
      "units": [
        {
          "measurement": 10,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 25,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 35,
          "label": "minutes"
        }
      ]
    }
  ],
  "title": "Curried Ground Beef with Peas and Potatoes"
}
