{
  "createdDate": "04/15/2021",
  "image": "devils-food-cake.jpg",
  "ingredients": [
    {
      "category": "Cake",
      "items": [
        "24 tablespoons (3 sticks) unsalted butter",
        "1 1/2 cups (12 ounces) black coffee or black tea, such as assam",
        "1 cup (3 ounces) Dutch-process cocoa powder",
        "1 1/4 cups (6 ounces) finely chopped dark chocolate, about 72 percent",
        "2 cups loosely packed (16 ounces) light brown sugar",
        "1 tablespoon vanilla extract",
        "1 teaspoon kosher salt (see headnote)",
        "6 large eggs, straight from the refrigerator, plus 3 tablespoons (1 1/2 ounces) egg yolks (from about 3 large eggs)",
        "2 cups (9 ounces) flour (see headnote)",
        "1 tablespoon baking soda"
      ]
    },
    {
      "category": "Milk Chocolate Frosting",
      "items": [
        "3 3/4 cups (20 ounces) finely chopped 35 percent milk chocolate (see headnote)",
        "3 cups (24 ounces) heavy cream",
        "1/4 teaspoon kosher salt (see headnote)"
      ]
    }
  ],
  "instructions": [
    "Getting Ready: Adjust oven rack to lower-middle position and preheat to 350°F (180°C). Line three 8- by 3-inch anodized aluminum pans with parchment and grease with pan spray. (The cakes can be baked in 2-inch-deep pans, but they will dome more and rise less.)",
    "For the Cake: Combine butter and coffee or tea in a 5-quart stainless steel pot or saucier over low heat. Once melted, remove from heat, then mix in cocoa and chocolate, followed by brown sugar, vanilla, and salt. Mix in eggs and yolks, then sift in flour and baking soda. Whisk thoroughly to combine.",
    "Divide batter between prepared cake pans, about 23 ounces each. (If you don't have three pans, the remaining batter can be held at room temperature up to 90 minutes, though the rise will not be quite as high.) Bake until cakes are firm but your finger can still leave an impression in the puffy crust, about 30 minutes (a toothpick inserted into the center should come away with a few crumbs still attached).",
    "Cool cakes directly in their pans for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off parchment, and return cakes right side up. Meanwhile, prepare the buttercream.",
    "Heat the cream in a 3-quart stainless-steel saute pan over medium heat. Once it's bubbling hard around the edges, pour over the chocolate; whisk by hand until smooth and stir in the salt. Let cool until the mixture is no longer steaming. Cover and refrigerate for 6 hours or until thick and cold, around 45 degrees. (Alternatively, cool in a sink full of ice water, stirring and scraping from time to time with a flexible spatula, about 1 hour.)",
    "Use the balloon-whisk attachment to beat the mixture on medium-high until thick and silky. This can take from 75 to 120 seconds, so watch it closely. It’s best to use the frosting right away; the yield is about 5 1/2 cups, all of which will be used for this cake.",
    "When you're ready to assemble the cake, loosen the layers with a knife, invert onto a wire rack, peel off the parchment and then flip over to the original top. Trim the top crusts from the cakes with a serrated knife. Place one layer, cut side up, on a serving plate. Cover with a cup of the frosting, spreading it into an even layer with the back of a spoon. Repeat with the second and third layers, cut side down. Finish the top and sides of the cake with the remaining frosting.",
    "Let cake return to cool room temperature before serving. Under a cake dome or an inverted pot, the frosted cake will keep 24 hours at cool room temperature. After cutting, wrap leftover slices individually and store at cool room temperature up to 3 days more."
  ],
  "notes": ["A little dry, but the frosting helps quite a bit."],
  "rating": 9,
  "servings": 12,
  "slug": "devils-food-cake",
  "source": {
    "url": "https://www.seriouseats.com/recipes/2018/02/bravetarts-devils-food-cake.html",
    "name": "Serious Eats"
  },
  "tags": ["Vegetarian", "Dessert", "Baking"],
  "time": [
    {
      "label": "Active",
      "units": [
        {
          "measurement": 30,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 3,
          "label": "hours"
        }
      ]
    }
  ],
  "title": "Devil's Food Cake"
}
