{
  "title": "Minestrone Soup",
  "servings": 6,
  "rating": 7,
  "slug": "minestrone",
  "source": {
    "name": "Serious Eats",
    "url": "https://www.seriouseats.com/the-best-minestrone-soup-recipe"
  },
  "createdDate": "08/08/2024",
  "instructions": [
    "For the Beans: In a medium bowl, cover beans with cold water by several inches and stir in 1 tablespoon salt. Let beans soak at least 12 hours and up to a day. Drain and rinse.",
    "Combine beans, onion halves, carrot, celery, garlic cloves, rosemary, parsley, and bay leaf in a large pot and cover with water by several inches. Add a pinch of salt. Bring to a boil, reduce to a simmer, and cook, topping up with water as necessary, until beans are fully tender, about 45 minutes. Using tongs, discard vegetables and aromatics. Drain beans, reserving cooking liquid. Transfer bean-cooking liquid to a 2-quart measuring cup and add enough cold water to equal 2 full quarts (8 cups; 2L).",
    "For the Soup Base: Heat pancetta (if using) and olive oil in a large Dutch oven or stockpot over medium-high heat. Cook, stirring, until pancetta has rendered fat and softened, but has not yet browned. (If omitting pancetta, heat oil just until shimmering.) Add onion, carrot, celery, and minced rosemary. Season with a big pinch of salt and cook, stirring, until vegetables are softened but not browned, 10 to 15 minutes, adding more oil if pot appears dry or if vegetables are starting to stick to the bottom.",
    "Add garlic and cook, stirring, until fragrant, about 30 seconds. Add tomatoes and cook, stirring, until most of their moisture has evaporated and the mixture starts to fry. (The sound should change from a sputtering simmering sound to a sharper crackle as vegetables start to fry.)",
    "Add reserved bean-cooking liquid, beans, and Parmesan rind, if using. Let broth simmer for at least 10 minutes.",
    "Add pasta (unless you are planning on simmering for a long time; see step 7), zucchini, squash, and green beans and simmer until pasta and vegetables are tender, about 10 minutes. Add spinach and cook, stirring occasionally, until spinach is wilted, about 5 minutes. Discard Parmesan rind, if used.",
    "Serve soup immediately as is, or continue simmering for up to 2 1/2 hours for a heartier texture and flavor (if simmering for a long time, add the pasta 10 to 15 minutes before serving). Alternatively, reserve half of soup on the side, continue to simmer the other half in the pot for up to 2 1/2 hours, and stir reserved soup back in for a soup that is hearty, but still has plenty of bright vegetable flavor and texture. Stir in chopped herbs and season to taste with salt and pepper before serving."
  ],
  "notes": [
    "Canned beans can be used in place of fresh. To use canned beans, in step 5, drain and rinse 2 cups of canned beans and add them to the soup, along with 2 quarts of homemade vegetable stock, or store-bought or homemade low-sodium chicken stock. Increase simmering time to 30 minutes before proceeding to step 6.",
    "Use fresh tomatoes only if ripe and in season. Otherwise, tomatoes may be omitted or replaced with one (14-ounce) can of whole peeled tomatoes, crushed by hand or chopped with a knife. A Parmesan rind can be added to the soup while simmering for deeper flavor.",
    "Carrot: peeled and cut into 1/2-inch chunks, sautéed at start until tender and cooked for 20 minutes",
    "Cauliflower: florets separated, stems sliced 1/4 inch thick and cooked for 20 minutes",
    "Celery: peeled and cut into 1/2-inch chunks, sautéed at start until tender and cooked for 20 minutes",
    "Celery root: peeled and cut into 1/2-inch chunks and cooked for 20 minutes",
    "Jicama: peeled and cut into 1/2-inch chunks and cooked for 20 minutes",
    "Kohlrabi: peeled and cut into 1/2-inch chunks and cooked for 20 minutes",
    "Leeks: thinly sliced or diced, sautéed at start until tender and cooked for 20 minutes",
    "Onion: thinly sliced or diced, sautéed at start until tender and cooked for 20 minutes",
    "Parsnip: peeled and cut into 1/2-inch chunks and cooked for 20 minutes",
    "Potato: peeled and cut into 1/2-inch chunks and cooked for 20 minutes",
    "Radish: cut into 1/2-inch chunks and cooked for 20 minutes",
    "Rutabaga: peeled and cut into 1/2-inch chunks and cooked for 20 minutes",
    "Sweet potato: peeled and cut into 1/2-inch chunks and cooked for 20 minutes",
    "Asparagus: cut into 1-inch lengths and cooked for 10 minutes",
    "Broccoli: florets separated, stems sliced 1/4 inch thick and cooked for 10 minutes",
    "Hearty greens (cabbage, kale, collards): tough stems or cores removed, leaves sliced or roughly chopped and cooked for 10 minutes",
    "Green beans: trimmed and cut into 1-inch pieces and cooked for 10 minutes",
    "Summer squash: cut into 1/2-inch chunks or disks and cooked for 10 minutes",
    "Zucchini: cut into 1/2-inch chunks or disks and cooked for 10 minutes",
    "Tender greens (spinach, arugula, watercress, chard): leaves roughly chopped or torn and cooked for 5 minutes",
    "Brussels sprouts: leaves separated and cooked for 5 minutes",
    "Frozen peas: added straight from freezer and cooked for 5 minutes",
    "Frozen lima beans: added straight from freezer and cooked for 5 minutes",
    "Corn kernels: cut off cob and separated into individual kernels and cooked for 5 minutes"
  ],
  "archived": false,
  "ingredients": [
    {
      "category": "Beans",
      "items": [
        "8 ounces (225g) dried cannellini, borlotti, or kidney beans",
        "Kosher salt",
        "1 medium onion, split in half (about 6 ounces; 175g)",
        "1 medium carrot (about 3 ounces; 85g)",
        "2 celery stalks (about 3 ounces; 85g)",
        "2 medium cloves garlic",
        "1 large sprig rosemary",
        "2 to 3 sprigs parsley",
        "1 bay leaf"
      ]
    },
    {
      "category": "Soup Base",
      "items": [
        "4 ounces (115g) salt pork or pancetta, cut into 1/4-inch dice (optional)",
        "2 tablespoons (30ml) extra-virgin olive oil, plus more as needed",
        "1 medium onion, finely chopped (about 6 ounces; 175g)",
        "1 medium carrot, peeled and finely diced (about 3 ounces; 85g)",
        "2 celery stalks, finely diced (about 3 ounces; 85g)",
        "1 tablespoon minced fresh rosemary leaves",
        "2 medium cloves garlic, minced (about 2 teaspoons; 12g)",
        "1 pound (450g) ripe Roma tomatoes, peeled, seeded, and chopped",
        "1 Parmesan rind (optional; see notes)"
      ]
    },
    {
      "category": "Finish",
      "items": [
        "1 cup dried small pasta, such as ditali, macaroni, or orecchiette (about 3 1/2 ounces; 100g)",
        "1 medium zucchini, cut into bite-size pieces (about 4 ounces; 115g)",
        "1 medium summer squash, cut into bite-size pieces (about 4 ounces; 115g)",
        "4 ounces green beans, cut into 1/2-inch lengths (about 115g)",
        "4 ounces spinach, roughly chopped (about 4 cups loosely packed leaves; 115g)",
        "Chopped fresh herbs, such as basil, parsley, or rosemary, for serving",
        "Freshly ground black pepper"
      ]
    }
  ],
  "tags": ["Vegan", "Vegetarian", "Soup", "Dinner", "Meal Prep"],
  "time": [
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 120,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Active",
      "units": [
        {
          "measurement": 60,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Inactive",
      "units": [
        {
          "measurement": 12,
          "label": "hours"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 14,
          "label": "hours"
        }
      ]
    }
  ],
  "image": "minestrone.webp",
  "related": []
}
