{
  "archived": false,
  "createdDate": "06/22/2024",
  "image": "risotto.webp",
  "ingredients": [
    {
      "category": "Risotto",
      "items": [
        "1 1/2 cups (about 13 1/2 ounces) risotto-style rice (see notes)",
        "1 quart (950ml) low-sodium homemade or store-bought chicken stock",
        "1 cup (240ml) white wine (optional; can be replaced with additional broth)",
        "2 tablespoons (30g) butter, plus more for finishing, if desired",
        "2 tablespoons (30ml) extra-virgin olive oil",
        "2 medium cloves garlic, grated on a Microplane (about 2 teaspoons)",
        "2 small shallots, finely minced (about 2 tablespoons)",
        "3/4 cup (180ml) heavy cream, whipped to stiff peaks",
        "3 ounces (85g) finely grated Parmesan cheese",
        "Kosher salt and freshly ground black pepper",
        "Chopped herbs or other garnishes, as desired"
      ]
    }
  ],
  "instructions": [
    "Combine rice, chicken stock, and wine in a large bowl. Agitate rice with fingers or a whisk to release starch. Strain through a fine-mesh strainer set in a 2-quart liquid cup measure or another large bowl. Allow to drain 5 minutes, stirring rice occasionally.",
    "Heat butter and oil in a heavy 12-inch skillet over medium-high heat until foaming subsides. Add rice and cook, stirring and tossing frequently, until all liquid has evaporated, fat is bubbling, and rice has begun to take on a golden blond color and nutty aroma, about 5 minutes. Add garlic and shallots and continue to cook, stirring frequently, until aromatic, about 1 minute. Give reserved broth a good stir and pour all but 1 cup over rice. Increase heat to high and heat until simmering. Stir rice once, cover, and reduce heat to lowest possible setting.",
    "Cook rice for 10 minutes, undisturbed. Stir once, shake pan gently to redistribute rice, cover, and continue cooking until liquid is mostly absorbed and rice is tender with just a faint bite, about 10 minutes longer.",
    "Remove lid and add final cup of stock. Increase heat to high and cook, stirring and shaking rice constantly, until risotto is thick and creamy. Off heat, fold in heavy cream and cheese. Season to taste with salt and pepper and stir in herbs as desired. Serve immediately on hot plates."
  ],
  "notes": [
    "I prefer using carnaroli rice for its slightly longer grains and firmer texture. Feel free to use any risotto-style rice, like arborio or vialone nano.",
    "Keep an eye on the rice after the first 10 minutes, it's more likely to be 6-8 minutes than 10"
  ],
  "rating": 8,
  "related": ["roasted-garlic-scapes"],
  "servings": 8,
  "slug": "risotto",
  "source": {
    "name": "J. Kenji López-Alt",
    "url": "https://www.seriouseats.com/how-to-make-perfect-risotto-recipe"
  },
  "tags": ["Vegetarian", "Dinner", "Stovetop"],
  "time": [
    {
      "label": "Prep",
      "units": [
        {
          "measurement": 15,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 35,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Active",
      "units": [
        {
          "measurement": 15,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 1,
          "label": "hour"
        },
        {
          "measurement": 5,
          "label": "minutes"
        }
      ]
    }
  ],
  "title": "Risotto"
}
