{
  "archived": false,
  "createdDate": "08/26/2023",
  "image": "sliced-pork-with-chives.webp",
  "ingredients": [
    {
      "category": "For the Pork:",
      "items": [
        "1 pound boneless pork loin, cut into 2-inch matchsticks",
        "¼ teaspoon (2 g) sugar",
        "¼ teaspoon (1 g) freshly ground white pepper",
        "1 teaspoon (5 ml) Shaoxing wine or dry sherry",
        "1 teaspoon (5 ml) light soy sauce or shoyu",
        "1 teaspoon (5 ml) roasted sesame oil",
        "½ teaspoon (2 g) baking soda",
        "1 teaspoon (3 g) cornstarch"
      ]
    },
    {
      "category": "For the Sauce:",
      "items": [
        "½ teaspoon (2 g) freshly ground white pepper",
        "1½ tablespoons (about 25 ml) Shaoxing wine",
        "1½ tablespoons (about 25 ml) light soy sauce or shoyu"
      ]
    },
    {
      "category": "For the Stir-Fry:",
      "items": [
        "4 ounces (100 g) yellow chives, cut into 2-inch segments (see Note)",
        "4 ounces (100 g) Chinese chives, cut into 2-inch segments (see Note)",
        "Kosher salt",
        "3 tablespoons (45 ml) peanut, rice bran, or other neutral oil",
        "2 teaspoons (5 g) minced garlic (about 2 medium cloves)",
        "2 teaspoons (5 g) minced fresh ginger (about ½-inch segment)"
      ]
    }
  ],
  "instructions": [
    "For the Pork: Place the pork in a medium bowl, cover with cold water, and vigorously agitate it. Drain through a fine-mesh strainer set in the sink and press on the pork with your hands to remove excess water. Return the pork to the bowl and add the sugar, white pepper, wine, soy sauce, sesame oil, baking soda, and cornstarch. Stir vigorously with your fingertips or chopsticks for 30 seconds. Set aside for 15 minutes at room temperature.",
    "Meanwhile, Make the Sauce: Combine the white pepper, wine, and soy sauce in a small bowl. Set aside.",
    "BEFORE YOU STIR-FRY, GET YOUR BOWLS READY: a. Yellow chives and Chinese chives, b. Marinated pork, c. Garlic and ginger, d. Sauce, e. Empty bowl for cooked ingredients, f. Serving platter",
    "For the Stir-Fry: Heat a wok over high heat until lightly smoking. Add 1 tablespoon (15 ml) of the oil and swirl to coat. Add the yellow chives and Chinese chives and cook, tossing and stirring occasionally, until brightly colored and barely tender, about 1 minute. Season with salt. Transfer to a large bowl and set aside.",
    "Wipe out the wok and return it to high heat until lightly smoking. Add 1 tablespoon (15 ml) of the remaining oil and swirl to coat. Add half of the pork, spread into a single layer, and cook without moving until lightly browned, about 45 seconds. Cook, tossing and stirring frequently until barely cooked through, about 30 seconds longer. Transfer to the bowl with chives.",
    "Wipe out the wok and return it to high heat until lightly smoking. Add the remaining tablespoon (15 ml) oil and swirl to coat. Add the remaining pork, spread into a single layer, and cook without moving until lightly browned, about 45 seconds. Cook, tossing and stirring frequently until barely cooked through, about 30 seconds longer. Return the other half of the pork and chives to the wok and clear a small space in the center. Add the garlic and ginger and cook, tossing constantly, until fragrant, about 30 seconds. Add the sauce mixture and toss to combine. Season to taste with more salt if necessary. Transfer to a serving platter and serve immediately."
  ],
  "notes": [
    "Chinese yellow chives and green blossoming chives can be found at most Asian supermarkets. If unavailable, you can use leeks or regular yellow onions or shallots. For leeks, trim off the bases and green tops, then cut the whites lengthwise into ¼-inch strips. For yellow onions or shallots, remove the tops and bottoms, peel, split in half from pole to pole, and cut into ¼-inch slices from pole to pole."
  ],
  "rating": 8,
  "related": [],
  "servings": 4,
  "slug": "sliced-pork-with-chives",
  "source": {
    "name": "J. Kenji Lopez Alt",
    "url": "https://www.amazon.com/Wok-Techniques-J-Kenji-L%C3%B3pez-Alt/dp/0393541215"
  },
  "tags": ["Pork", "Quick", "Dinner", "Stovetop"],
  "time": [
    {
      "label": "Prep",
      "units": [
        {
          "measurement": 15,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 20,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 35,
          "label": "minutes"
        }
      ]
    }
  ],
  "title": "Sliced Pork with Chives"
}
