{
  "title": "Summer Nachos With Tomatoes, Corn, Chicken, and Cheese",
  "servings": 4,
  "rating": 9,
  "slug": "summer-nachos",
  "source": {
    "name": "Serious Eats",
    "url": "https://www.seriouseats.com/summer-nachos-chicken-corn-tomato-cheese-recipe"
  },
  "instructions": [
    "For the Pickled Radishes: In a small saucepan, combine vinegar, water, sugar, salt, mustard seeds, coriander seeds, black peppercorns, and bay leaf. Bring to a simmer, stirring occasionally, until sugar and salt dissolve. Remove from the heat and let cool 5 minutes. Pack sliced radishes into a 2-cup heatproof Mason or other glass canning jar. Pour brine into jar, making sure to cover the radishes completely. Allow to cool to room temperature, about 20 minutes. Seal jar with a tight-fitting lid and shake or rotate it to evenly distribute the brine and spices. The pickles will be ready in about 1 hour, but are best after a few hours. They can be refrigerated up to 1 week.",
    "For the Bourbon Barbecue Sauce: In a small saucepan, stir together ketchup, chicken stock, sugar, vinegar, 1/4 cup bourbon (60ml), onion, Dijon, molasses, soy sauce, Worcestershire sauce, hot sauce, and black pepper. Bring to a simmer, reduce heat to low and cook, stirring occasionally, until reduced by about one-third (sauce should be glaze-like). Stir in the remaining tablespoon of bourbon and add more vinegar or hot sauce to taste, if desired. Cooled barbecue sauce can be stored in a sealed container in the refrigerator for up to 1 month.",
    "For the Nachos: Heat oil in a 12-inch cast iron skillet, Dutch oven, or wok over medium-high heat until it registers 375°F. Adjust flame to maintain temperature. Working in batches, add tortillas and fry, agitating with a metal spider, until edges just start to brown. Flip chips over and continue to cook until crisp and light golden brown. Transfer chips to a paper towel-lined tray, sprinkle with salt to taste, and let sit for 2 to 3 minutes to drain. Repeat with remaining batches. Set aside until ready to use.",
    "In a medium bowl, combine chicken with 3/4 cup (180ml) of Bourbon Barbecue Sauce. Toss to coat. Season with salt and pepper and add more sauce if needed.",
    "Adjust oven rack to center position and preheat oven to 375°F.",
    "Layer 1/2 of chips in the bottom of a rimmed 9-by-13-inch baking sheet or baking dish. Drizzle with half of the cheese sauce and scatter half the shredded barbecue chicken on top. Top with half the corn kernels and sprinkle with half the grated cheese.",
    "Layer the remaining chips on top. Drizzle with remaining cheese sauce, chicken, and corn. Top with jalapeños and sprinkle all over with remaining grated cheese. Bake until grated cheese is completely melted, about 5 minutes.",
    "Top with tomatoes, onion, and avocado and drizzle all over with sour cream or crema. Garnish with cilantro leaves and drained pickled radish slices. Serve immediately."
  ],
  "notes": [
    "Frying your own tortilla chips yields the best results, since they're guaranteed to be thick and crisp enough to stand up to the toppings; if you have a good source of store-bought tortilla chips, feel free to skip the frying step and use them here.",
    "For the chicken, you can buy a rotisserie chicken and pull the meat off, or roast or grill your own."
  ],
  "ingredients": [
    {
      "category": "For the Pickled Radishes",
      "items": [
        "1/2 cup red or white wine vinegar (120ml)",
        "1/4 cup water (60ml)",
        "2 tablespoons granulated sugar",
        "2 teaspoons kosher salt",
        "1/2 teaspoon whole mustard seeds",
        "1/4 teaspoon whole coriander seeds",
        "1/4 teaspoon whole black peppercorns",
        "1 bay leaf",
        "1 bunch radishes (about 10 to 13 radishes), tops trimmed and discarded, radishes thinly sliced"
      ]
    },
    {
      "category": "For the Bourbon Barbecue Sauce",
      "items": [
        "1/2 cup ketchup (120ml)",
        "1/2 cup homemade chicken stock or store-bought low-sodium chicken broth (120ml)",
        "1/2 cup light brown sugar",
        "1/4 cup cider vinegar (60ml), plus more if needed",
        "1/4 cup plus 1 tablespoon bourbon (75ml), divided",
        "1 small onion, grated on the large holes of a box grater (about 4 ounces; 115g)",
        "2 tablespoons Dijon mustard (30ml)",
        "1 tablespoon dark molasses (15ml)",
        "1 tablespoon soy sauce (15ml)",
        "1 tablespoon Worcestershire sauce (15ml)",
        "2 teaspoons hot sauce (10ml), plus more if needed",
        "1/2 teaspoon freshly ground black pepper"
      ]
    },
    {
      "category": "For the Nachos",
      "items": [
        "3 to 4 cups peanut, vegetable, or canola oil, for frying (see note)",
        "20 fresh corn tortillas, cut into 6 wedges each (see note)",
        "3 ears grilled shucked sweet corn, kernels sliced off with a sharp knife",
        "2 cups (10 ounces) cooked shredded cooked chicken meat (see note)",
        "8 ounces Pepper Jack cheese (225g), grated",
        "1/4 cup thinly sliced pickled or fresh jalapeños, stemmed (and seeded, if you want to reduce their heat)",
        "1 cup (5 ounces; 140g) chopped grape or cherry tomatoes",
        "1/2 small red onion, cut into small dice",
        "1 ripe Hass avocado, pitted, flesh scooped from skin, and cubed",
        "1/2 cup sour cream or crema (120ml)",
        "1/4 cup picked cilantro leaves",
        "1 1/2 cups Nacho Cheese Sauce"
      ]
    }
  ],
  "tags": ["Poultry", "Dinner", "Stovetop", "Appetizer", "Grilling"],
  "time": [
    {
      "label": "Active",
      "units": [
        {
          "measurement": 40,
          "label": "minutes"
        },
        {
          "measurement": 1,
          "label": "hour"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 40,
          "label": "minutes"
        },
        {
          "measurement": 1,
          "label": "hour"
        }
      ]
    }
  ],
  "image": "summer-nachos.webp",
  "related": ["cheese-sauce-for-fries-and-nachos"]
}
