{
  "time": [
    {
      "label": "Prep",
      "units": [
        {
          "measurement": 15,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 40,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 55,
          "label": "minutes"
        }
      ]
    }
  ],
  "slug": "thai-coconut-curry-carrot-soup",
  "title": "Thai Coconut Curry Carrot Soup",
  "servings": 6,
  "image": "../images/thai-coconut-curry-carrot-soup.jpg",
  "rating": 9,
  "notes": [
    ""
  ],
  "source": "https://www.budgetbytes.com/thai-coconut-curry-carrot-soup/",
  "ingredients": [
    {
      "category": "",
      "items": [
        "2 Tbsp butter or coconut oil",
        "1 yellow onion",
        "4 Tbsp red Thai curry paste",
        "1 lb. carrots",
        "1 sweet potato (about 3/4 lb.)",
        "3 cups vegetable broth*",
        "1 13.5oz. can full fat coconut milk",
        " salt and pepper to taste"
      ]
    },
    {
      "category": "Optional Garnishes",
      "items": [
        " cilantro",
        " sriracha"
      ]
    }
  ],
  "instructions": [
    "Dice the onion and add it to a large pot along with the butter (or coconut oil). Sauté the onion until soft and translucent (about 5 minutes).",
    "Once the onions are soft, add the Thai curry paste and continue to sauté for about a minute more.",
    "While the onion is sautéing, peel and dice the sweet potato (about 1-inch cubes). Add the sweet potato to the pot after the curry paste has sautéed, and continue to sauté the sweet potatoes while you peel and slice the carrots. Add the carrots to the pot as you slice them.",
    "Add the vegetable broth to the pot, stir to combine, place a lid on top, and turn the heat up to medium-high. Allow the soup to come to a boil, then turn the heat down to low (or just above low) and allow it to simmer for 30 minutes, stirring occasionally. After 30 minutes the sweet potatoes and carrots should be extremely tender and fall apart as you stir the pot.",
    "Turn the heat off and remove the pot from the hot stove top to facilitate cooling (to another area on the stove is fine). Add the coconut milk and stir to combine. You can reserve a tablespoon or two of the coconut milk to garnish the finished soup, if desired.",
    "Use an immersion blender, or allow the soup to cool further and carefully purée in batches using a traditional blender. Once the soup is puréed, give it a taste and add salt or pepper if desired (this will depend largely on the type of broth used). Garnish with fresh cilantro and a drizzle of sriracha, if desired."
  ],
  "createdDate": "12/8/2021"
}