{
  "archived": false,
  "createdDate": "04/17/2023",
  "image": "tres-leche.webp",
  "ingredients": [
    {
      "category": "Cake batter",
      "items": [
        "Vegetable oil",
        "6 3/4 ounces cake flour, plus extra for pan",
        "1 teaspoon baking powder",
        "1/2 teaspoon kosher salt",
        "4 ounces unsalted butter, room temperature",
        "8 ounces sugar",
        "5 whole eggs",
        "1 1/2 teaspoons vanilla extract"
      ]
    },
    {
      "category": "Glaze",
      "items": [
        "1 (12-ounce) can evaporated milk",
        "1 (14-ounce) can sweetened condensed milk",
        "1 cup half-and-half"
      ]
    },
    {
      "category": "Topping",
      "items": [
        "2 cups heavy cream",
        "8 ounces sugar",
        "1 teaspoon vanilla extract"
      ]
    }
  ],
  "instructions": [
    "Preheat the oven to 350 degrees F. Lightly oil and flour a 13 by 9-inch metal pan and set aside.",
    "Whisk together the cake flour, baking powder and salt in a medium mixing bowl and set aside.",
    "Place the butter into the bowl of a stand mixer. Using the paddle attachment, beat on medium speed until fluffy, approximately 1 minute. Decrease the speed to low and with the mixer still running, gradually add the sugar over 1 minute. Stop to scrape down the sides of the bowl, if necessary. Add the eggs, 1 at a time, and mix to thoroughly combine. Add the vanilla extract and mix to combine. Add the flour mixture to the batter in 3 batches and mix just until combined. Transfer the batter to the prepared pan and spread evenly. This will appear to be a very small amount of batter. Bake on the middle rack of the oven for 20 to 25 minutes or until the cake is lightly golden and reaches an internal temperature of 200 degrees F.",
    "Remove the cake pan to a cooling rack and allow to cool for 30 minutes. Poke the top of the cake all over with a skewer or fork. Allow the cake to cool completely and then prepare the glaze.",
    "Whisk together the evaporated milk, sweetened condensed milk and the half-and-half in a 1-quart measuring cup. Once combined, pour the glaze over the cake. Refrigerate the cake overnight.;",
    "For the topping: place the heavy cream, sugar and vanilla into the bowl of a stand mixer. Using the whisk attachment, whisk together on low until stiff peaks are formed. Change to medium speed and whisk until thick. Spread the topping over the cake and allow to chill in the refrigerator until ready to serve."
  ],
  "notes": [
    "Cake is already sweet enough, could probably not add sugar to the topping and it would be better."
  ],
  "rating": 8,
  "related": [],
  "servings": 8,
  "slug": "tres-leche",
  "source": {
    "name": "Alton Brown",
    "url": "https://www.foodnetwork.com/recipes/alton-brown/tres-leche-cake-recipe-1953815"
  },
  "tags": ["Vegetarian", "Dessert", "Baking"],
  "time": [
    {
      "label": "Prep",
      "units": [
        {
          "measurement": 45,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 25,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Inactive",
      "units": [
        {
          "measurement": 8,
          "label": "hours"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 9,
          "label": "hours"
        },
        {
          "measurement": 10,
          "label": "minutes"
        }
      ]
    }
  ],
  "title": "Tres Leche"
}
