{
  "createdDate": "4/9/2021",
  "image": "../images/unstuffed-bell-peppers.jpg",
  "ingredients": [
    {
      "category": "All",
      "items": [
        "1 clove garlic",
        "1 yellow onion",
        "2 bell peppers",
        "1 Tbsp olive oil",
        "1/2 lb. ground beef",
        "1 15oz. can diced tomatoes",
        "1 cup long grain white rice (uncooked)",
        "1 tsp dried basil",
        "1 tsp dried oregano",
        "1/4 tsp freshly cracked black pepper",
        "1.5 cups beef broth",
        "1 8oz. can tomato sauce",
        "1 tsp Worcestershire sauce",
        "1 cup shredded mozzarella",
        "1 Tbsp  chopped parsley (optional garnish)"
      ]
    }
  ],
  "instructions": [
    "Mince the garlic and dice the onion and bell pepper.",
    "Add the olive oil and ground beef to a deep skillet. Cook the beef over medium heat until it is fully browned. ",
    "Add the diced onion, bell pepper, minced garlic, basil, oregano, and pepper to the skillet. Continue to cook and stir until the onions are soft. ",
    "Next, add the diced tomatoes (with juices), uncooked rice, and beef broth. Give everything a brief stir to combine.",
    "Place a lid on the skillet and turn the heat up to medium-high. Allow the broth to come up to a full boil. Once boiling, turn the heat down to low and let it continue to simmer for 15 minutes. After 15 minutes, turn the heat off and let it rest, lid still in place, for another five minutes.",
    "While the pot is simmering, combine the tomato sauce and Worcestershire sauce. ",
    "Once the rice has rested for 5 minutes, remove the lid and fluff it with a fork, gently folding the ingredients back together (peppers and tomatoes may float to the top while it simmers). ",
    "Pour the prepared tomato sauce over top, then sprinkled the shredded mozzarella over the sauce. Place the lid back on top and let the heat from the skillet melt the mozzarella. Once melted, sprinkle a little chopped parsley on top and serve."
  ],
  "notes": [
    "Good, quick, cheap"
  ],
  "rating": 7,
  "servings": 6,
  "slug": "unstuffed-bell-peppers",
  "source": "https://www.budgetbytes.com/unstuffed-bell-peppers/",
  "time": [
    {
      "label": "Prep",
      "units": [
        {
          "measurement": 15,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Cook",
      "units": [
        {
          "measurement": 45,
          "label": "minutes"
        }
      ]
    },
    {
      "label": "Total",
      "units": [
        {
          "measurement": 1,
          "label": "hour"
        }
      ]
    }
  ],
  "tags": [
    "Beef",
    "Dinner",
    "Baking",
    "Roasting"
  ],
  "title": "Unstuffed Bell Peppers"
}